# Add/Remove Rows and Columns From DataFrames

In [109]:
people = {
    "Name" : ["Jafar","Surya","Vikram"],
    "No"   : [10,20,30],
    "Mail" : ["shaikmohammadhussain999@gmail.com","Surya@gmail.com","Vikram@gmail.com"]
}

In [110]:
import pandas as pd

In [111]:
df = pd.DataFrame(people)

In [112]:
df

     Name  No                               Mail
0   Jafar  10  shaikmohammadhussain999@gmail.com
1   Surya  20                    Surya@gmail.com
2  Vikram  30                   Vikram@gmail.com

# Adding one Column with name of 'Last'

In [113]:
df['Last'] = ['Hussain' , 'Rolex' ,'Kamal']

In [114]:
df

     Name  No                               Mail     Last
0   Jafar  10  shaikmohammadhussain999@gmail.com  Hussain
1   Surya  20                    Surya@gmail.com    Rolex
2  Vikram  30                   Vikram@gmail.com    Kamal

# Adding to Column to get one result

In [115]:
df['Full_Name'] = df['Name'] + ' ' + df['Last']
df

     Name  No                               Mail     Last      Full_Name
0   Jafar  10  shaikmohammadhussain999@gmail.com  Hussain  Jafar Hussain
1   Surya  20                    Surya@gmail.com    Rolex    Surya Rolex
2  Vikram  30                   Vikram@gmail.com    Kamal   Vikram Kamal

In [116]:
df.rename(columns={'Name' : 'First'} , inplace=True)
df

    First  No                               Mail     Last      Full_Name
0   Jafar  10  shaikmohammadhussain999@gmail.com  Hussain  Jafar Hussain
1   Surya  20                    Surya@gmail.com    Rolex    Surya Rolex
2  Vikram  30                   Vikram@gmail.com    Kamal   Vikram Kamal

# Deleting the Columns

In [117]:
df.drop(columns= ['First','Last'] ,inplace=True )
df

   No                               Mail      Full_Name
0  10  shaikmohammadhussain999@gmail.com  Jafar Hussain
1  20                    Surya@gmail.com    Surya Rolex
2  30                   Vikram@gmail.com   Vikram Kamal

# Spliting the one column in to two columns

In [118]:
df[['First','Last']] = df['Full_Name'].str.split(' ',expand=True)
df

   No                               Mail      Full_Name   First     Last
0  10  shaikmohammadhussain999@gmail.com  Jafar Hussain   Jafar  Hussain
1  20                    Surya@gmail.com    Surya Rolex   Surya    Rolex
2  30                   Vikram@gmail.com   Vikram Kamal  Vikram    Kamal

In [119]:
df.append( { 'First' : 'Tony'} , ignore_index=True)

C:\Users\shaik\AppData\Local\Temp\ipykernel_7508\2157790321.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append( { 'First' : 'Tony'} , ignore_index=True)

     No                               Mail      Full_Name   First     Last
0  10.0  shaikmohammadhussain999@gmail.com  Jafar Hussain   Jafar  Hussain
1  20.0                    Surya@gmail.com    Surya Rolex   Surya    Rolex
2  30.0                   Vikram@gmail.com   Vikram Kamal  Vikram    Kamal
3   NaN                                NaN            NaN    Tony      NaN

#####

In [149]:
people1 = {
    "First" : ["Tony","Steve"],
    "No"   : [50,60],
    "Mail" : ["Iron.com","Capitan@gmail.com",]
}
df1= pd.DataFrame(people1)

In [150]:
df1

   First  No               Mail
0   Tony  50           Iron.com
1  Steve  60  Capitan@gmail.com

In [151]:
df = df.append(df1,ignore_index=True)

C:\Users\shaik\AppData\Local\Temp\ipykernel_7508\3060255050.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(df1,ignore_index=True)

# Remove the Row by using the index

In [152]:
df.drop(index=3,inplace=True)
df

   No                               Mail      Full_Name   First     Last
0  10  shaikmohammadhussain999@gmail.com  Jafar Hussain   Jafar  Hussain
1  20                    Surya@gmail.com    Surya Rolex   Surya    Rolex
2  30                   Vikram@gmail.com   Vikram Kamal  Vikram    Kamal
4  60                  Capitan@gmail.com            NaN   Steve      NaN
5  50                           Iron.com            NaN    Tony      NaN
6  60                  Capitan@gmail.com            NaN   Steve      NaN

In [155]:
filt = (df['First'] == 'Steve')
df.drop(index=df[filt].index)

   No                               Mail      Full_Name   First     Last
0  10  shaikmohammadhussain999@gmail.com  Jafar Hussain   Jafar  Hussain
1  20                    Surya@gmail.com    Surya Rolex   Surya    Rolex
2  30                   Vikram@gmail.com   Vikram Kamal  Vikram    Kamal
5  50                           Iron.com            NaN    Tony      NaN